class QuestionAr {
  final String questionText;
  final List<AnswerAr> answerList;
  QuestionAr(this.questionText, this.answerList);
}

class AnswerAr {
  final String answerText;
  final bool isCorrect;
  AnswerAr(this.answerText, this.isCorrect);
}

List<QuestionAr> getQuestions() {
  List<QuestionAr> list = [];

  list.add(QuestionAr(
    "على مدار الأسبوع الماضي ، هل واجهت مشاكل في تذكر الأشياء ، أو متابعة المحادثات ، أو الانتباه ، أو التفكير بوضوح ، أو إيجاد طريقك في المنزل أو في المدينة؟",
    [
      AnswerAr("0: طبيعي: لا ضعف إدراكي", true),
      AnswerAr(
          "1: طفيف: ضعف يقدره المريض أو مقدم الرعاية دون تدخل ملموس في قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية",
          true),
      AnswerAr(
          "2: خفيف: خلل إدراكي واضح سريريًا ، ولكن الحد الأدنى من التدخل في قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية.",
          true),
      AnswerAr(
          "3: متوسط: يتداخل العجز المعرفي مع قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية ، ولكنه لا يمنعها.",
          true),
      AnswerAr(
          "4: شديد: الخلل الوظيفي المعرفي يحول دون قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية.",
          true),
    ],
  ));
  list.add(QuestionAr(
    "هل رأيت أو سمعت أو شممت أو شعرت خلال الأسبوع الماضي بأشياء لم تكن موجودة بالفعل؟",
    [
      AnswerAr("0: طبيعي: لا هلوسة أو سلوك ذهاني", true),
      AnswerAr(
          "1: طفيف: أوهام أو هلوسات غير متكونة لكن المريض يتعرف عليها دون أن يفقد بصيرته.",
          true),
      AnswerAr(
          "2: خفيف: هلوسة مشكلة مستقلة عن المحفزات البيئية. لا تفقد البصيرة.",
          true),
      AnswerAr("3: متوسط: هلوسة مشكلة مع فقدان البصيرة.", true),
      AnswerAr("4: شديد: المريض لديه أوهام أو اضطرابات وهلوسة.", true),
    ],
  ));
  list.add(QuestionAr(
    "هل شعرت خلال الأسبوع الماضي بالإحباط أو الحزن أو اليأس أو عدم القدرة على الاستمتاع بالأشياء؟ إذا كانت الإجابة بنعم ، فهل استمر هذا الشعور لمدة تزيد عن يوم واحد في كل مرة؟ هل جعل من الصعب عليك القيام بأنشطتك المعتادة أو أن تكون مع الناس؟",
    [
      AnswerAr("0: طبيعي: لا مزاج مكتئب.", true),
      AnswerAr(
          "1: طفيف: نوبات من الاكتئاب المزاجي لا تستمر لأكثر من يوم واحد في كل مرة. لا يتعارض مع قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية.",
          true),
      AnswerAr(
          "2: خفيف: مزاج مكتئب يستمر على مدى أيام ، ولكن دون التدخل في الأنشطة العادية والتفاعلات الاجتماعية.",
          true),
      AnswerAr(
          "3: متوسط: مزاج مكتئب يتداخل مع قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية ولكنه لا يمنعها.",
          true),
      AnswerAr(
          "4: شديد: المزاج المكتئب يحول دون قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية.",
          true),
    ],
  ));

  list.add(QuestionAr(
    "هل شعرت خلال الأسبوع الماضي بالتوتر أو القلق أو التوتر؟ إذا كانت الإجابة بنعم ، فهل استمر هذا الشعور لمدة تزيد عن يوم واحد في كل مرة؟ هل جعل من الصعب عليك متابعة أنشطتك المعتادة أو التواجد مع أشخاص آخرين؟",
    [
      AnswerAr("0: طبيعي: لا مشاعر قلق.", true),
      AnswerAr(
          "1: طفيف: مشاعر القلق موجودة ولكن لا تستمر لأكثر من يوم واحد في كل مرة. لا يتعارض مع قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية.",
          true),
      AnswerAr(
          "2: خفيف: تستمر مشاعر القلق لأكثر من يوم واحد في كل مرة ، ولكن دون التدخل في قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية.",
          true),
      AnswerAr(
          "3: متوسط: تتداخل مشاعر القلق مع قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية ، ولكنها لا تمنعها.",
          true),
      AnswerAr(
          "4: شديد: مشاعر القلق تحول دون قدرة المريض على القيام بالأنشطة العادية والتفاعلات الاجتماعية.",
          true),
    ],
  ));

  list.add(QuestionAr(
    "هل شعرت خلال الأسبوع الماضي بعدم المبالاة بالقيام بالأنشطة أو التواجد مع الناس؟",
    [
      AnswerAr("0: طبيعي: لا مشاعر قلق.", true),
      AnswerAr(
          "1: طفيف: اللامبالاة موضع تقدير من قبل المريض و / أو مقدم الرعاية ، ولكن دون تدخل في الأنشطة اليومية والتفاعلات الاجتماعية",
          true),
      AnswerAr(
          "2: خفيف: اللامبالاة تتداخل مع الأنشطة المعزولة والتفاعلات الاجتماعية.",
          true),
      AnswerAr(
          "3: متوسط: اللامبالاة تتعارض مع معظم الأنشطة والتفاعلات الاجتماعية.",
          true),
      AnswerAr("4: شديد: سلبي ومنسحب ، خسارة كاملة للمبادرة.", true),
    ],
  ));

  list.add(QuestionAr(
    "على مدار الأسبوع الماضي ، هل كانت لديك حوافز قوية بشكل غير عادي يصعب التحكم فيها؟ هل تشعر بأنك مدفوع لفعل شيء ما أو تفكر فيه وتجد صعوبة في التوقف؟",
    [
      AnswerAr("0: طبيعي: لا توجد مشاكل", true),
      AnswerAr(
          "1: طفيف: المشاكل موجودة ولكنها عادة لا تسبب أي صعوبات للمريض أو الأسرة / مقدم الرعاية",
          true),
      AnswerAr(
          "2: خفيف: المشاكل موجودة وعادة ما تسبب بعض الصعوبات في حياة المريض الشخصية والعائلية.",
          true),
      AnswerAr(
          "3: متوسط: المشاكل موجودة وعادة ما تسبب الكثير من الصعوبات في حياة المريض الشخصية والعائلية.",
          true),
      AnswerAr(
          "4: شديد: توجد مشاكل وتحول دون قدرة المريض على القيام بأنشطة طبيعية أو تفاعلات اجتماعية أو الحفاظ على المعايير السابقة في الحياة الشخصية والعائلية.",
          true),
    ],
  ));

  list.add(QuestionAr(
    "خلال الأسبوع الماضي ، هل واجهت صعوبة في النوم ليلاً أو البقاء نائماً طوال الليل؟",
    [
      AnswerAr("0: طبيعي: لا مشاكل.", true),
      AnswerAr(
          "1: طفيف: مشاكل النوم موجودة ولكنها عادة لا تسبب مشكلة في الحصول على ليلة نوم كاملة",
          true),
      AnswerAr(
          "2: خفيف: عادة ما تسبب مشاكل النوم بعض الصعوبات في الحصول على ليلة نوم كاملة.",
          true),
      AnswerAr(
          "3: متوسط: مشاكل النوم تسبب الكثير من الصعوبات في الحصول على ليلة نوم كاملة ، لكني ما زلت أنام عادة لأكثر من نصف الليل.",
          true),
      AnswerAr("4: شديد: عادة لا أنام معظم الليل.", true),
    ],
  ));

  list.add(QuestionAr(
    "خلال الأسبوع الماضي ، هل واجهت صعوبة في البقاء مستيقظًا أثناء النهار؟",
    [
      AnswerAr("0: طبيعي: لا نعاس أثناء النهار.", true),
      AnswerAr(
          "1: طفيف: يحدث النعاس أثناء النهار ، لكن يمكنني المقاومة وأبقى مستيقظًا.",
          true),
      AnswerAr(
          "2: خفيف: أحيانًا أغفو عندما أكون وحيدًا وأسترخي. على سبيل المثال ، أثناء القراءة أو مشاهدة التلفزيون.",
          true),
      AnswerAr(
          "3: متوسط: أحيانًا أغفو عندما لا أفعل. على سبيل المثال ، أثناء الأكل أو التحدث مع الآخرين.",
          true),
      AnswerAr(
          "4: شديد: غالبًا ما أنام عندما لا أفعل. على سبيل المثال ، أثناء الأكل أو التحدث مع الآخرين.",
          true),
    ],
  ));

  list.add(QuestionAr(
    "خلال الأسبوع الماضي ، هل شعرت بمشاعر غير مريحة في جسدك مثل الألم ، أو الأوجاع ، أو الوخز ، أو التشنجات؟",
    [
      AnswerAr("0: طبيعي: لا مشاعر مزعجة.", true),
      AnswerAr(
          "1: طفيف: لدي هذه المشاعر. ومع ذلك ، يمكنني أن أفعل الأشياء وأن أكون مع أشخاص آخرين دون صعوبة.",
          true),
      AnswerAr(
          "2: خفيف: هذه المشاعر تسبب بعض المشاكل عندما أفعل أشياء أو أكون مع أشخاص آخرين.",
          true),
      AnswerAr(
          "3: متوسط: هذه المشاعر تسبب الكثير من المشاكل ، لكنها لا تمنعني من فعل الأشياء أو التواجد مع أشخاص آخرين.",
          true),
      AnswerAr(
          "4: شديد: هذه المشاعر تمنعني من فعل الأشياء أو التواجد مع الآخرين.",
          true),
    ],
  ));

  list.add(QuestionAr(
    "على مدار الأسبوع الماضي ، هل واجهت مشكلة في التحكم في البول؟ على سبيل المثال ، حاجة ملحة للتبول ، الحاجة للتبول بكثرة ، أو حوادث التبول؟",
    [
      AnswerAr("0: طبيعي: لا توجد مشاكل في التحكم في البول.", true),
      AnswerAr(
          "1: طفيف: مشاكل البول تسبب بعض الصعوبات في أنشطتي اليومية. ومع ذلك ، ليس لدي حوادث بول.",
          true),
      AnswerAr(
          "2: خفيف: هذه المشاعر تسبب بعض المشاكل عندما أفعل أشياء أو أكون مع أشخاص آخرين.",
          true),
      AnswerAr(
          "3: متوسط: تسبب مشاكل البول الكثير من الصعوبات في أنشطتي اليومية ، بما في ذلك حوادث البول.",
          true),
      AnswerAr(
          "4: شديد: لا أستطيع التحكم في البول واستخدام الملابس الواقية أو أنبوب المثانة.",
          true),
    ],
  ));

  list.add(QuestionAr(
    "هل عانيت خلال الأسبوع الماضي من مشاكل الإمساك التي تسبب لك صعوبة في تحريك أمعائك؟",
    [
      AnswerAr("0: طبيعي: لا إمساك", true),
      AnswerAr(
          "1: طفيف: لقد أصبت بالإمساك. أبذل مجهودًا إضافيًا لتحريك أمعائي ، لكن هذه المشكلة لا تزعج أنشطتي أو كوني مرتاحة.",
          true),
      AnswerAr(
          "2: خفيف: الإمساك يسبب لي بعض المشاكل في القيام بالأشياء أو الشعور بالراحة.",
          true),
      AnswerAr(
          "3: متوسط: الإمساك يسبب لي الكثير من المتاعب في القيام بالأشياء أو الشعور بالراحة. ومع ذلك ، فهو لا يمنعني من فعل أي شيء.",
          true),
      AnswerAr(
          "4: شديد: عادة ما أحتاج إلى مساعدة جسدية من شخص آخر لتفريغ أمعائي",
          true),
    ],
  ));
  list.add(QuestionAr(
    "خلال الأسبوع الماضي ، هل شعرت بالإغماء أو الدوار أو الضباب عند الوقوف بعد الجلوس أو الاستلقاء؟",
    [
      AnswerAr("0: طبيعي: لا مشاعر بالدوار أو الضبابية.", true),
      AnswerAr(
          "1: طفيف: الشعور بالدوار أو الضبابية. ومع ذلك ، فهي لا تسبب لي مشاكل في القيام بالأشياء.",
          true),
      AnswerAr(
          "2: خفيف: الشعور بالدوار أو الضباب يجعلني أمسك بشيء ما ، لكني لست بحاجة للجلوس أو الاستلقاء.",
          true),
      AnswerAr(
          "3: متوسط: الشعور بالدوار أو الضباب يجعلني أجلس أو أستلقي لتجنب الإغماء أو السقوط.",
          true),
      AnswerAr(
          "4: شديد: الشعور بدوار أو ضبابي يسبب لي السقوط أو الإغماء.", true),
    ],
  ));

  list.add(QuestionAr(
    "على مدار الأسبوع الماضي ، هل شعرت عادة بالإرهاق؟ هذا الشعور ليس جزءًا من الشعور بالنعاس أو الحزن",
    [
      AnswerAr("0: طبيعي: لا تعب", true),
      AnswerAr(
          "1: طفيف: يحدث التعب. ومع ذلك ، فإنه لا يسبب لي مشاكل في فعل الأشياء أو التواجد مع الناس.",
          true),
      AnswerAr(
          "2: خفيف: التعب يسبب لي بعض المتاعب في فعل الأشياء أو التواجد مع الناس.",
          true),
      AnswerAr(
          "3: متوسط: التعب يسبب لي الكثير من المتاعب في القيام بالأشياء أو التواجد مع الناس. ومع ذلك ، فهو لا يمنعني من فعل أي شيء.",
          true),
      AnswerAr(
          "4: شديد: التعب يمنعني من فعل الأشياء أو التواجد مع الناس.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.1-خلال الأسبوع الماضي ، هل واجهت مشاكل في حديثك؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr(
          "1: طفيف: كلامي رقيق أو متداخل أو غير متساوٍ ، لكنه لا يجعل الآخرين يطلبون مني أن أكرر نفسي.",
          true),
      AnswerAr(
          "2: خفيف: كلامي يجعل الناس يطلبون مني أن أكرر نفسي من حين لآخر ، ولكن ليس كل يوم.",
          true),
      AnswerAr(
          "3: متوسط: كلامي غير واضح بما يكفي لدرجة أن الآخرين يطلبون مني أن أكرر نفسي كل يوم على الرغم من أن معظم كلامي مفهوم.",
          true),
      AnswerAr("4: شديد: لا يمكن فهم معظم كلامي أو كله.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.2-خلال الأسبوع الماضي ، هل عانيت في العادة من إفراط في اللعاب أثناء استيقاظك أو أثناء نومك؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr("1: طفيف: لدي الكثير من اللعاب ، لكن لا يسيل لعابي", true),
      AnswerAr(
          "2: خفيف: يسيل لعابي أثناء النوم ، لكن لا شيء عندما أكون مستيقظًا.",
          true),
      AnswerAr(
          "3: متوسط: لدي بعض سيلان اللعاب عندما أكون مستيقظا ، لكنني عادة لا أحتاج إلى مناديل أو منديل",
          true),
      AnswerAr(
          "4: شديد: يسيل لعابي كثيرًا لدرجة أنني أحتاج بانتظام إلى استخدام المناديل أو المنديل لحماية ملابسي.",
          true),
    ],
  ));
  list.add(QuestionAr(
    "2.3-خلال الأسبوع الماضي ، هل عانيت عادة من مشاكل في بلع الحبوب أو تناول وجبات الطعام؟ هل تحتاج إلى تقطيع حبوبك أو سحقها أو أن تكون وجباتك طرية أو مفرومة أو ممزوجة لتجنب الاختناق؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr(
          "1: طفيف: أدرك البطء في المضغ أو زيادة الجهد في البلع ، لكنني لا أختنق أو أحتاج إلى إعداد طعامي بشكل خاص.",
          true),
      AnswerAr(
          "2: خفيف: أحتاج إلى قطع حبوبي أو تحضير طعامي بشكل خاص بسبب مشاكل في المضغ أو البلع ، لكنني لم أختنق خلال الأسبوع الماضي.",
          true),
      AnswerAr(
          "3: متوسط. لقد اختنقت مرة واحدة على الأقل في الأسبوع الماضي", true),
      AnswerAr(
          "4: شديد: بسبب مشاكل المضغ والبلع ، أحتاج إلى أنبوب تغذية.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.4-خلال الأسبوع الماضي ، هل عانيت عادة من مشاكل في التعامل مع طعامك واستخدام أدوات الأكل؟ على سبيل المثال ، هل تواجه مشكلة في التعامل مع الأطعمة التي تعمل بالأصابع أو استخدام الشوك والسكاكين والملاعق وعيدان تناول الطعام؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr(
          "1: طفيف: أنا بطيء ، لكني لست بحاجة إلى أي مساعدة في التعامل مع طعامي ولم أتعرض لانسكاب طعام أثناء تناول الطعام.",
          true),
      AnswerAr(
          "2: خفيف: أنا بطيء في تناول الطعام ولدي بعض الانسكابات الغذائية. قد أحتاج إلى مساعدة في بعض المهام مثل تقطيع اللحم",
          true),
      AnswerAr(
          "3: متوسط: أحتاج إلى مساعدة في العديد من مهام الأكل ولكن يمكنني إدارة بعضها بمفرده",
          true),
      AnswerAr("4: شديد: أحتاج إلى مساعدة لمعظم أو كل مهام الأكل.", true),
    ],
  ));
  list.add(QuestionAr(
    "2.5-خلال الأسبوع الماضي ، هل عانيت عادة من مشاكل في ارتداء الملابس؟ على سبيل المثال ، هل أنت بطيء أو تحتاج إلى مساعدة في الأزرار ، أو استخدام السحابات ، أو ارتداء أو خلع ملابسك أو مجوهراتك؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr("1: طفيف: أنا بطيء لكني لست بحاجة إلى مساعدة.", true),
      AnswerAr(
          "2: خفيف: أنا بطيء وأحتاج إلى مساعدة في بعض مهام ارتداء الملابس (الأزرار والأساور).",
          true),
      AnswerAr("3: متوسط: أحتاج إلى مساعدة في العديد من مهام التضميد.", true),
      AnswerAr("4: شديد: أحتاج إلى مساعدة لمعظم أو كل مهام التضميد.", true),
    ],
  ));
  list.add(QuestionAr(
    "2.6-على مدار الأسبوع الماضي ، هل كنت عادة بطيئًا أو تحتاج إلى مساعدة في الغسيل أو الاستحمام أو الحلاقة أو تنظيف الأسنان أو تمشيط شعرك أو في النظافة الشخصية الأخرى؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr("1: طفيف: أنا بطيء ، لكني لست بحاجة إلى أي مساعدة.", true),
      AnswerAr(
          "2: خفيف: أحتاج إلى شخص آخر لمساعدتي في بعض مهام النظافة.", true),
      AnswerAr("3: متوسط: أحتاج إلى مساعدة في العديد من مهام النظافة.", true),
      AnswerAr(
          "4: شديد: أحتاج إلى مساعدة في معظم أو كل مهام النظافة الخاصة بي.",
          true),
    ],
  ));

  list.add(QuestionAr(
    "2.7-خلال الأسبوع الماضي ، هل واجه الناس عادة مشكلة في قراءة خط يدك؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr(
          "1: طفيف: كتابتي بطيئة أو خرقاء أو غير متساوية ، لكن كل الكلمات واضحة.",
          true),
      AnswerAr("2: خفيف: بعض الكلمات غير واضحة ويصعب قراءتها.", true),
      AnswerAr("3: متوسط: العديد من الكلمات غير واضحة ويصعب قراءتها.", true),
      AnswerAr("4: شديد: لا يمكن قراءة معظم الكلمات أو كلها.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.8-خلال الأسبوع الماضي ، هل واجهت عادة مشكلة في ممارسة هواياتك أو أشياء أخرى تحب القيام بها؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr(
          "1: طفيف: أنا بطيء بعض الشيء لكني أقوم بهذه الأنشطة بسهولة.", true),
      AnswerAr("2: خفيف: أجد صعوبة في القيام بهذه الأنشطة.", true),
      AnswerAr(
          "3: متوسط: لدي مشاكل كبيرة في القيام بهذه الأنشطة ، ولكن ما زلت أفعل معظمها",
          true),
      AnswerAr("4: شديد: لا أستطيع القيام بمعظم أو كل هذه الأنشطة.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.9-خلال الأسبوع الماضي ، هل تواجه عادة مشكلة في الانقلاب في السرير؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr(
          "1: طفيف: لدي بعض الصعوبة في الاستدارة ، لكني لست بحاجة إلى أي مساعدة.",
          true),
      AnswerAr(
          "2: خفيف لدي الكثير من المتاعب في التحول وأحتاج من حين لآخر إلى مساعدة من شخص آخر.",
          true),
      AnswerAr(
          "3: متوسط: للتسليم غالبًا ما أحتاج إلى مساعدة من شخص آخر.", true),
      AnswerAr("4: شديد: لا أستطيع أن أتحول دون مساعدة من شخص آخر.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.10-على مدار الأسبوع الماضي ، هل عانيت عادة من رعشة أو رعشة؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق. ليس لدي أي اهتزاز أو رعشة.", true),
      AnswerAr(
          "1: طفيف: يحدث رعشة أو رعشة ولكنها لا تسبب مشاكل في أي نشاط", true),
      AnswerAr(
          "2: خفيف: الرعشة أو الرعشة تسبب مشاكل في عدد قليل من الأنشطة", true),
      AnswerAr(
          "3: متوسط: الرعشة أو الرعشة تسبب مشاكل في العديد من أنشطتي اليومية.",
          true),
      AnswerAr(
          "4: شديد: الرعشة أو الرعشة تسبب مشاكل في معظم أو كل الأنشطة.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.11-خلال الأسبوع الماضي ، هل عانيت عادة من صعوبة في النهوض من السرير أو مقعد السيارة أو الكرسي العميق؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق.", true),
      AnswerAr(
          "1: طفيف: أنا بطيء أو محرج ، لكنني عادةً ما يمكنني القيام بذلك في محاولتي الأولى.",
          true),
      AnswerAr(
          "2: خفيف: أحتاج إلى أكثر من محاولة للنهوض أو أحتاج إلى مساعدة من حين لآخر",
          true),
      AnswerAr(
          "3: متوسط: أحيانًا أحتاج إلى مساعدة للاستيقاظ ، لكن في معظم الأوقات لا يزال بإمكاني القيام بذلك بمفردي.",
          true),
      AnswerAr(
          "4: شديد: أحتاج إلى المساعدة في معظم الأوقات أو طوال الوقت.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.12-على مدار الأسبوع الماضي ، هل عانيت عادة من مشاكل في التوازن والمشي؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق.", true),
      AnswerAr(
          "1: طفيف: أنا بطيء قليلاً أو قد أسحب رجلي. لا أستخدم أبدًا أداة مساعدة على المشي.",
          true),
      AnswerAr(
          "2: خفيف: أستخدم أحيانًا أداة مساعدة على المشي ، لكني لست بحاجة إلى أي مساعدة من شخص آخر",
          true),
      AnswerAr(
          "3: متوسط: عادة ما أستخدم أداة مساعدة على المشي (عصا ، مشاية) للمشي بأمان دون أن أسقط. ومع ذلك ، فأنا عادة لا أحتاج إلى دعم شخص آخر.",
          true),
      AnswerAr(
          "4: شديد: عادة ما أستخدم دعم شخص آخر للمشي بأمان دون أن أسقط.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.13-خلال الأسبوع الماضي ، في يومك المعتاد عند المشي ، هل تتوقف فجأة أو تتجمد كما لو كانت قدميك عالقة على الأرض؟",
    [
      AnswerAr("0: طبيعي: لا على الإطلاق.", true),
      AnswerAr(
          "1: طفيف: أتجمد لفترة وجيزة ، لكن يمكنني بسهولة البدء في المشي مرة أخرى. لا أحتاج إلى مساعدة من شخص آخر أو مساعد للمشي (عصا أو مشاية) بسبب التجميد.",
          true),
      AnswerAr(
          "2: خفيف: أتجمد وأجد صعوبة في البدء في المشي مرة أخرى ، لكني لست بحاجة إلى مساعدة أحد أو أداة مساعدة على المشي (عصا أو مشاية) بسبب التجمد.",
          true),
      AnswerAr(
          "3: متوسط: عندما أتجمد أجد صعوبة كبيرة في البدء في المشي مرة أخرى ، وبسبب التجمد ، أحتاج أحيانًا إلى استخدام أداة مساعدة على المشي أو أحتاج إلى مساعدة شخص آخر.",
          true),
      AnswerAr(
          "4: شديد: بسبب التجمد ، في معظم الأوقات أو طوال الوقت ، أحتاج إلى استخدام أداة مساعدة على المشي أو مساعدة شخص ما.",
          true),
    ],
  ));

  //part2

  return list;
}
