class QuestionAr {
  final String questionText;
  final List<AnswerAr> answerList;
  QuestionAr(this.questionText, this.answerList);
}

class AnswerAr {
  final String answerText;
  final bool isCorrect;
  AnswerAr(this.answerText, this.isCorrect);
}

List<QuestionAr> getQuestions() {
  List<QuestionAr> list = [];

  list.add(QuestionAr(
    "على مدار الأسبوع الماضي ، هل واجهت مشاكل في تذكر الأشياء ، أو متابعة المحادثات ، أو الانتباه ، أو التفكير بوضوح ، أو إيجاد طريقك في المنزل أو في المدينة؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));
  list.add(QuestionAr(
    "هل رأيت أو سمعت أو شممت أو شعرت خلال الأسبوع الماضي بأشياء لم تكن موجودة بالفعل؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));
  list.add(QuestionAr(
    "هل شعرت خلال الأسبوع الماضي بالإحباط أو الحزن أو اليأس أو عدم القدرة على الاستمتاع بالأشياء؟ إذا كانت الإجابة بنعم ، فهل استمر هذا الشعور لمدة تزيد عن يوم واحد في كل مرة؟ هل جعل من الصعب عليك القيام بأنشطتك المعتادة أو أن تكون مع الناس؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "هل شعرت خلال الأسبوع الماضي بالتوتر أو القلق أو التوتر؟ إذا كانت الإجابة بنعم ، فهل استمر هذا الشعور لمدة تزيد عن يوم واحد في كل مرة؟ هل جعل من الصعب عليك متابعة أنشطتك المعتادة أو التواجد مع أشخاص آخرين؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "هل شعرت خلال الأسبوع الماضي بعدم المبالاة بالقيام بالأنشطة أو التواجد مع الناس؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "على مدار الأسبوع الماضي ، هل كانت لديك حوافز قوية بشكل غير عادي يصعب التحكم فيها؟ هل تشعر بأنك مدفوع لفعل شيء ما أو تفكر فيه وتجد صعوبة في التوقف؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "خلال الأسبوع الماضي ، هل واجهت صعوبة في النوم ليلاً أو البقاء نائماً طوال الليل؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "خلال الأسبوع الماضي ، هل واجهت صعوبة في البقاء مستيقظًا أثناء النهار؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "خلال الأسبوع الماضي ، هل شعرت بمشاعر غير مريحة في جسدك مثل الألم ، أو الأوجاع ، أو الوخز ، أو التشنجات؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "على مدار الأسبوع الماضي ، هل واجهت مشكلة في التحكم في البول؟ على سبيل المثال ، حاجة ملحة للتبول ، الحاجة للتبول بكثرة ، أو حوادث التبول؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "هل عانيت خلال الأسبوع الماضي من مشاكل الإمساك التي تسبب لك صعوبة في تحريك أمعائك؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));
  list.add(QuestionAr(
    "خلال الأسبوع الماضي ، هل شعرت بالإغماء أو الدوار أو الضباب عند الوقوف بعد الجلوس أو الاستلقاء؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "على مدار الأسبوع الماضي ، هل شعرت عادة بالإرهاق؟ هذا الشعور ليس جزءًا من الشعور بالنعاس أو الحزن",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "2.1-خلال الأسبوع الماضي ، هل واجهت مشاكل في حديثك؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "2.2-خلال الأسبوع الماضي ، هل عانيت في العادة من إفراط في اللعاب أثناء استيقاظك أو أثناء نومك؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));
  list.add(QuestionAr(
    "2.3-خلال الأسبوع الماضي ، هل عانيت عادة من مشاكل في بلع الحبوب أو تناول وجبات الطعام؟ هل تحتاج إلى تقطيع حبوبك أو سحقها أو أن تكون وجباتك طرية أو مفرومة أو ممزوجة لتجنب الاختناق؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));

  list.add(QuestionAr(
    "2.4-خلال الأسبوع الماضي ، هل عانيت عادة من مشاكل في التعامل مع طعامك واستخدام أدوات الأكل؟ على سبيل المثال ، هل تواجه مشكلة في التعامل مع الأطعمة التي تعمل بالأصابع أو استخدام الشوك والسكاكين والملاعق وعيدان تناول الطعام؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));
  list.add(QuestionAr(
    "2.5-خلال الأسبوع الماضي ، هل عانيت عادة من مشاكل في ارتداء الملابس؟ على سبيل المثال ، هل أنت بطيء أو تحتاج إلى مساعدة في الأزرار ، أو استخدام السحابات ، أو ارتداء أو خلع ملابسك أو مجوهراتك؟",
    [
      AnswerAr("طبيعي", true),
      AnswerAr("طفيف", true),
      AnswerAr("خفيف", true),
      AnswerAr("متوسط", true),
      AnswerAr("شديد", true),
    ],
  ));
  list.add(QuestionAr(
    "2.6-على مدار الأسبوع الماضي ، هل كنت عادة بطيئًا أو تحتاج إلى مساعدة في الغسيل أو الاستحمام أو الحلاقة أو تنظيف الأسنان أو تمشيط شعرك أو في النظافة الشخصية الأخرى؟",
    [
      AnswerAr("0: عادي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr("1: طفيف: أنا بطيء ، لكني لست بحاجة إلى أي مساعدة.", true),
      AnswerAr(
          "2: معتدل: أحتاج إلى شخص آخر لمساعدتي في بعض مهام النظافة.", true),
      AnswerAr("3: معتدل: أحتاج إلى مساعدة في العديد من مهام النظافة.", true),
      AnswerAr(
          "4: شديد: أحتاج إلى مساعدة في معظم أو كل مهام النظافة الخاصة بي.",
          true),
    ],
  ));

  list.add(QuestionAr(
    "2.7-خلال الأسبوع الماضي ، هل واجه الناس عادة مشكلة في قراءة خط يدك؟",
    [
      AnswerAr("0: عادي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr(
          "1: طفيف: كتابتي بطيئة أو خرقاء أو غير متساوية ، لكن كل الكلمات واضحة.",
          true),
      AnswerAr("2: خفيف: بعض الكلمات غير واضحة ويصعب قراءتها.", true),
      AnswerAr("3: متوسط: العديد من الكلمات غير واضحة ويصعب قراءتها.", true),
      AnswerAr("4: شديد: لا يمكن قراءة معظم الكلمات أو كلها.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.8-خلال الأسبوع الماضي ، هل واجهت عادة مشكلة في ممارسة هواياتك أو أشياء أخرى تحب القيام بها؟",
    [
      AnswerAr("0: عادي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr(
          "1: طفيف: أنا بطيء بعض الشيء لكني أقوم بهذه الأنشطة بسهولة.", true),
      AnswerAr("2: خفيف: أجد صعوبة في القيام بهذه الأنشطة.", true),
      AnswerAr(
          "3: معتدل: لدي مشاكل كبيرة في القيام بهذه الأنشطة ، ولكن ما زلت أفعل معظمها",
          true),
      AnswerAr("4: شديد: لا أستطيع القيام بمعظم أو كل هذه الأنشطة.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.9-خلال الأسبوع الماضي ، هل تواجه عادة مشكلة في الانقلاب في السرير؟",
    [
      AnswerAr("0: عادي: لا على الإطلاق (لا توجد مشاكل).", true),
      AnswerAr(
          "1: طفيف: لدي بعض الصعوبة في الاستدارة ، لكني لست بحاجة إلى أي مساعدة.",
          true),
      AnswerAr(
          "2: معتدل لدي الكثير من المتاعب في التحول وأحتاج من حين لآخر إلى مساعدة من شخص آخر.",
          true),
      AnswerAr(
          "3: معتدل: للتسليم غالبًا ما أحتاج إلى مساعدة من شخص آخر.", true),
      AnswerAr("4: شديد: لا أستطيع أن أتحول دون مساعدة من شخص آخر.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.10-على مدار الأسبوع الماضي ، هل عانيت عادة من رعشة أو رعشة؟",
    [
      AnswerAr("0: عادي: لا على الإطلاق. ليس لدي أي اهتزاز أو رعشة.", true),
      AnswerAr(
          "1: طفيف: يحدث رعشة أو رعشة ولكنها لا تسبب مشاكل في أي نشاط", true),
      AnswerAr(
          "2: خفيف: الرعشة أو الرعشة تسبب مشاكل في عدد قليل من الأنشطة", true),
      AnswerAr(
          "3: متوسط: الرعشة أو الرعشة تسبب مشاكل في العديد من أنشطتي اليومية.",
          true),
      AnswerAr(
          "4: شديد: الرعشة أو الرعشة تسبب مشاكل في معظم أو كل الأنشطة.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.11-خلال الأسبوع الماضي ، هل عانيت عادة من صعوبة في النهوض من السرير أو مقعد السيارة أو الكرسي العميق؟",
    [
      AnswerAr("0: عادي: لا على الإطلاق.", true),
      AnswerAr(
          "1: طفيف: أنا بطيء أو محرج ، لكنني عادةً ما يمكنني القيام بذلك في محاولتي الأولى.",
          true),
      AnswerAr(
          "2: معتدل: أحتاج إلى أكثر من محاولة للنهوض أو أحتاج إلى مساعدة من حين لآخر",
          true),
      AnswerAr(
          "3: معتدل: أحيانًا أحتاج إلى مساعدة للاستيقاظ ، لكن في معظم الأوقات لا يزال بإمكاني القيام بذلك بمفردي.",
          true),
      AnswerAr(
          "4: شديد: أحتاج إلى المساعدة في معظم الأوقات أو طوال الوقت.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.12-على مدار الأسبوع الماضي ، هل عانيت عادة من مشاكل في التوازن والمشي؟",
    [
      AnswerAr("0: عادي: لا على الإطلاق.", true),
      AnswerAr(
          "1: طفيف: أنا بطيء قليلاً أو قد أسحب رجلي. لا أستخدم أبدًا أداة مساعدة على المشي.",
          true),
      AnswerAr(
          "2: خفيف: أستخدم أحيانًا أداة مساعدة على المشي ، لكني لست بحاجة إلى أي مساعدة من شخص آخر",
          true),
      AnswerAr(
          "3: معتدل: عادة ما أستخدم أداة مساعدة على المشي (عصا ، مشاية) للمشي بأمان دون أن أسقط. ومع ذلك ، فأنا عادة لا أحتاج إلى دعم شخص آخر.",
          true),
      AnswerAr(
          "4: شديد: عادة ما أستخدم دعم شخص آخر للمشي بأمان دون أن أسقط.", true),
    ],
  ));

  list.add(QuestionAr(
    "2.13-خلال الأسبوع الماضي ، في يومك المعتاد عند المشي ، هل تتوقف فجأة أو تتجمد كما لو كانت قدميك عالقة على الأرض؟",
    [
      AnswerAr("0: عادي: لا على الإطلاق.", true),
      AnswerAr(
          "1: طفيف: أتجمد لفترة وجيزة ، لكن يمكنني بسهولة البدء في المشي مرة أخرى. لا أحتاج إلى مساعدة من شخص آخر أو مساعد للمشي (عصا أو مشاية) بسبب التجميد.",
          true),
      AnswerAr(
          "2: خفيف: أتجمد وأجد صعوبة في البدء في المشي مرة أخرى ، لكني لست بحاجة إلى مساعدة أحد أو أداة مساعدة على المشي (عصا أو مشاية) بسبب التجمد.",
          true),
      AnswerAr(
          "3: معتدل: عندما أتجمد أجد صعوبة كبيرة في البدء في المشي مرة أخرى ، وبسبب التجمد ، أحتاج أحيانًا إلى استخدام أداة مساعدة على المشي أو أحتاج إلى مساعدة شخص آخر.",
          true),
      AnswerAr(
          "4: شديد: بسبب التجمد ، في معظم الأوقات أو طوال الوقت ، أحتاج إلى استخدام أداة مساعدة على المشي أو مساعدة شخص ما.",
          true),
    ],
  ));

  //part2

  return list;
}
